USE irrigation_dispatching;
GO

INSERT INTO irrigation_institution(crop_id ,irrigation_number , round_order,quota,stage) 
VALUES 
(1,	1,	2,	74,	'二叶期'),
(1,	2,	3,	69,	'拨节始期'),	
(1,	3,	4,	71,	'抽穗始期'),
(1,	4,	5,	73,	'灌浆盛期'),
(1,	5,	6,	71,	'黄熟期'),
(3,	1,	4,	71,	'针叶期'),
(3,	2,	5,	73,	'拨节期'),
(3,	3,	6,	71,	'抽雄穗期'),	
(3,	4,	7,	72,	'撒粉期'),
(3,	5,	8,	73,	'灌浆始期、黄熟期'),	
(3,	1,	3,	69,	'幼苗期'),
(3,	2,	4,	71,	'分枝期'),
(3,	3,	5,	73,	'开花结果期'),	
(3,	4,	6,	71,	'成熟期'),
(13,	1,	7,	73,	'现蕾期'),
(13,	2,	6,	71,	'花铃期'),
(13,	3,	7,	72,	'吐絮期'),
(14,	1,	2,	74,	'幼苗分叉期'),	
(14,	2,	3,	69,	'现蕾期'),
(14,	3,	4,	71,	'开花结果期');
GO	
